<!doctype html>
<html>
  <head>
  <meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport">
  <meta charset="UTF-8">
  <title>
          BinaryWave
      </title>
  <link rel="stylesheet" href="css/normalize.css">
  <link rel="stylesheet" href="css/style.css">
  <link rel="stylesheet" href="css/grayscale.css">
  <link rel="icon" type="image/png" href="/img/favicon-32x32.png">
  </head>
  <body id="top">

    <nav>
      <img class="nav__logo" src="/img/logo.svg" alt="">
      
    </nav>

    <header>
        <h1 class="header__title header__title--main"><span>BinaryWave</span></h1>
  <span class="header__desc header__desc--main">&#x418;&#x437;&#x433;&#x43E;&#x438; &#x441; &#x43D;&#x43E;&#x443;&#x442;&#x430;&#x43C;&#x438;</span>
    </header>

    <aside>
      <dl class="side__list">
                <dt>&#x421;&#x441;&#x44B;&#x43B;&#x43A;&#x438;</dt>
          <dd><a target="_blank" href="https://github.com/0bwave">GitHub</a></dd>
          <dd><a target="_blank" href="https://gitter.im/0bwave/Lobby">Gitter (&#x427;&#x430;&#x442;)</a></dd>
          <dd><a target="_blank" href="https://t.me/binarywave">Telegram</a></dd>
            </dl>
    </aside>

    <main>
                        <p><em>&#x41D;&#x430;&#x441;&#x442;&#x430;&#x43B;&#x438; &#x442;&#x435;&#x43C;&#x43D;&#x44B;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x430;. &#x41F;&#x43E;&#x432;&#x441;&#x435;&#x43C;&#x435;&#x441;&#x442;&#x43D;&#x43E; &#x44D;&#x43A;&#x441;&#x43F;&#x43B;&#x443;&#x430;&#x442;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x431;&#x430;&#x439;&#x442;&#x44B;, &#x438;&#x437; &#x43D;&#x438;&#x445; &#x432;&#x44B;&#x43A;&#x430;&#x447;&#x438;&#x432;&#x430;&#x44E;&#x442; &#x43F;&#x440;&#x438;&#x431;&#x44B;&#x43B;&#x44C; &#x432; &#x43E;&#x431;&#x43C;&#x435;&#x43D; &#x43D;&#x430;, &#x434;&#x430;&#x44E;&#x449;&#x435;&#x435; &#x438;&#x43C; &#x436;&#x438;&#x437;&#x43D;&#x44C;, &#x44D;&#x43B;&#x435;&#x43A;&#x442;&#x440;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E;. &#x41F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43D;&#x443;&#x43B;&#x435;&#x439; &#x438; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446; &#x441;&#x442;&#x430;&#x43B; &#x43F;&#x43E;&#x434;&#x447;&#x438;&#x43D;&#x44F;&#x442;&#x441;&#x44F; &#x43C;&#x430;&#x440;&#x43A;&#x435;&#x442;&#x43E;&#x43B;&#x43E;&#x433;&#x430;&#x43C; &#x438; &#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;&#x43C; &#x440;&#x44B;&#x43D;&#x43A;&#x430;. &#x41D;&#x43E;&#x432;&#x430;&#x44F; &#x446;&#x438;&#x444;&#x440;&#x43E;&#x432;&#x430;&#x44F; &#x438;&#x434;&#x435;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x44F; &#x43F;&#x43E; &#x43F;&#x440;&#x435;&#x436;&#x43D;&#x435;&#x43C;&#x443; &#x43D;&#x43E;&#x441;&#x438;&#x442; &#x440;&#x430;&#x441;&#x442;&#x44F;&#x43D;&#x443;&#x442;&#x443;&#x44E; &#x444;&#x443;&#x442;&#x431;&#x43E;&#x43B;&#x43A;&#x443;, &#x43D;&#x43E; &#x441;&#x442;&#x430;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x443;&#x431;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x432;&#x441;&#x435;&#x445; &#x432;&#x43E;&#x43A;&#x440;&#x443;&#x433;, &#x447;&#x442;&#x43E; &#x43E;&#x43D;&#x430; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43A; &#x435;&#x435; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x433;&#x430;&#x43B;&#x441;&#x442;&#x443;&#x43A;&#x443;.</em></p>
<p><em>&#x410; &#x433;&#x434;&#x435;-&#x442;&#x43E;, &#x437;&#x430; &#x433;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;&#x43C;&#x438; &#x441;&#x438;&#x44F;&#x44E;&#x449;&#x438;&#x445; &#x43F;&#x43E;&#x441;&#x430;&#x434;&#x43E;&#x447;&#x43D;&#x44B;&#x445; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;, &#x43D;&#x430; &#x43E;&#x442;&#x448;&#x438;&#x431;&#x435; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44F;, &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x430; &#x440;&#x430;&#x437;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43E; &#x441;&#x43A;&#x430;&#x43B;&#x44B; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x430;&#x44F; &#x432;&#x43E;&#x43B;&#x43D;&#x430;. &#x420;&#x43E;&#x436;&#x434;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x435;&#x440;&#x44B; &#x432; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43C;&#x430;&#x433;&#x438;&#x44E;, &#x43E;&#x43D;&#x430; &#x43D;&#x435;&#x441;&#x435;&#x442; &#x431;&#x443;&#x439;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x443;&#x43B;&#x435;&#x439; &#x438; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446;, &#x441;&#x43F;&#x43B;&#x435;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x445;&#x441;&#x44F; &#x432; &#x438;&#x434;&#x435;&#x438;, &#x43C;&#x44B;&#x441;&#x43B;&#x438; &#x438; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440;&#x44B;.</em></p>
<h2 id="&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;">&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;<a class="anchor" href="#&#x41F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B;"></a></h2>
<ol>
<li>
<h3 id="&#x423;&#x420;&#x41E;&#x41A;&#x418;"><a href="http://lessons.0bwave.site">&#x423;&#x420;&#x41E;&#x41A;&#x418;</a><a class="anchor" href="#&#x423;&#x420;&#x41E;&#x41A;&#x418;"></a></h3>
&#x41D;&#x435;&#x442; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x430; &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x432;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E;, &#x43D;&#x435; &#x434;&#x430;&#x432;&#x430;&#x44F; &#x43B;&#x44E;&#x434;&#x44F;&#x43C; &#x441;&#x438;&#x43B;&#x443;. &#x414;&#x435;&#x43B;&#x438;&#x441;&#x44C; &#x43E;&#x43F;&#x44B;&#x442;&#x43E;&#x43C; &#x438; &#x43C;&#x438;&#x440; &#x432;&#x43E;&#x43A;&#x440;&#x443;&#x433; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43A;&#x440;&#x438;&#x447;&#x430;&#x442;&#x44C; &#x433;&#x440;&#x43E;&#x43C;&#x447;&#x435;, &#x430; &#x432;&#x43E;&#x43B;&#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x43D;&#x438;&#x43C;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x44B;&#x448;&#x435;.</li>
</ol>
<hr>
<p><em>&#x41D;&#x435;&#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x434;&#x435;&#x44F;&#x442;&#x44C;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x43D;&#x430;&#x448;&#x430; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44F; &#x438; &#x43D;&#x430;&#x448;&#x438; &#x434;&#x435;&#x43B;&#x430; &#x431;&#x443;&#x434;&#x443;&#x442; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x44C;. &#x412;&#x441;&#x435; &#x440;&#x430;&#x434;&#x438; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x438;&#x43D;&#x430;&#x447;&#x435; &#x43D;&#x435;&#x43B;&#x44C;&#x437;&#x44F; &#x438; &#x43D;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;. &#x421;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x441;&#x43F;&#x43B;&#x435;&#x442;&#x430;&#x44F; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x438;, &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;, &#x43D;&#x430;&#x440;&#x443;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B; &#x438; &#x447;&#x442;&#x43E;-&#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x434;&#x430;&#x432;&#x43D;&#x43E; &#x441;&#x438;&#x434;&#x438;&#x442; &#x433;&#x434;&#x435;-&#x442;&#x43E; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438;. &#x41F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x434;&#x432;&#x43E;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434; &#x438; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x432; &#x43D;&#x438;&#x43A;&#x443;&#x434;&#x430;.</em></p>
<h2 id="&#x411;&#x43B;&#x43E;&#x433;">&#x411;&#x43B;&#x43E;&#x433;<a class="anchor" href="#&#x411;&#x43B;&#x43E;&#x433;"></a></h2>
<ul>
<li><code>20.08.2017 |</code> <a href="blog/start">&#x412; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435;</a></li>
</ul>
<hr>
<p><em>&#x412;&#x43E;&#x43B;&#x43D;&#x430; &#x445;&#x43E;&#x447;&#x435;&#x442; &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x440;&#x435;&#x435; &#x440;&#x430;&#x437;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F;. &#x410; &#x43F;&#x43E;&#x43A;&#x430; &#x438;&#x449;&#x435;&#x442; &#x43B;&#x44E;&#x434;&#x435;&#x439;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x43C;&#x43E;&#x433;&#x443; &#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x442;&#x44C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x445;&#x43E;&#x442;&#x44F;&#x442; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x447;&#x435;&#x441;&#x442;&#x43D;&#x43E; &#x438; &#x431;&#x435;&#x437; &#x43A;&#x43E;&#x43C;&#x43F;&#x440;&#x43E;&#x43C;&#x438;&#x441;&#x441;&#x43E;&#x432;. &#x422;&#x430;&#x43A;, &#x43A;&#x430;&#x43A; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x441;&#x44F; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x443; &#x43D;&#x438;&#x445; &#x438; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x443; &#x43A;&#x43E;&#x433;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E;.</em></p>
<p><em>&#x418;&#x437;&#x432;&#x438;&#x43D;&#x438;&#x442;&#x435;, &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x434;&#x435;&#x43F;&#x440;&#x435;&#x441;&#x441;&#x438;&#x44F;.</em></p>

                  </main>

    <footer class="bar">
      <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/"><img alt="&#x41B;&#x438;&#x446;&#x435;&#x43D;&#x437;&#x438;&#x44F; Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by-nc-sa/4.0/80x15.png"></a>
      <a href="#top">^^^</a>
    </footer>

    <script src="/js/script.js"></script>

  </body>
</html>
